Config/DataProcessors/ПомощникЗаполненияПодразделенийВПроводках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникЗаполненияПодразделенийВПроводках</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/DataProcessors/ПомощникЗаполненияПодразделенийВПроводках/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОперацию(Параметры, АдресХранилища) Экспорт

	Если Параметры.Операция = "НайтиДокументы" Тогда
		
		СписокДок = НайтиДокументы(Параметры);
		ПоместитьВоВременноеХранилище(СписокДок, АдресХранилища);
		
	ИначеЕсли Параметры.Операция = "ПерепровестиДокументы" Тогда
		
		ПерепровестиДокументы(Параметры.СписокДокументов);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиДокументы(Параметры)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет"						, Параметры.Счет);
	Запрос.УстановитьПараметр("Организация"					, Параметры.Организация);
	Запрос.УстановитьПараметр("ПустоеПодразделение"			, Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяВалюта"				, Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("УчетПоПодразделениям"		, Параметры.УчетПоПодразделениям);
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет"	, Параметры.ВалютныйУчет);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Проводки.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(Проводки.Регистратор) КАК ДокументТип,
	|	Проводки.Регистратор.Дата КАК ДокументДата,
	|	Проводки.Регистратор.Номер КАК ДокументНомер
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК Проводки
	|ГДЕ
	|	Проводки.Организация = &Организация
	|	И (Проводки.СчетДт В (&Счет)
	|				И (&УчетПоПодразделениям
	|						И Проводки.СчетДт.УчетПоПодразделениям
	|						И (Проводки.ПодразделениеДт = &ПустоеПодразделение
	|							ИЛИ Проводки.ПодразделениеДт ЕСТЬ NULL)
	|					ИЛИ &ИспользоватьВалютныйУчет
	|						И Проводки.СчетДт.Валютный
	|						И (Проводки.ВалютаДт = &ПустаяВалюта
	|							ИЛИ Проводки.ВалютаДт ЕСТЬ NULL))
	|			ИЛИ Проводки.СчетКт В (&Счет)
	|				И (&УчетПоПодразделениям
	|						И Проводки.СчетКт.УчетПоПодразделениям
	|						И (Проводки.ПодразделениеКт = &ПустоеПодразделение
	|							ИЛИ Проводки.ПодразделениеКт ЕСТЬ NULL)
	|					ИЛИ &ИспользоватьВалютныйУчет
	|						И Проводки.СчетКт.Валютный
	|						И (Проводки.ВалютаКт = &ПустаяВалюта
	|							ИЛИ Проводки.ВалютаКт ЕСТЬ NULL)))
	|	И &УсловиеПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Док.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_Док КАК ВТ_Док
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Док.ДокументДата,
	|	ВТ_Док.ДокументТип,
	|	ВТ_Док.ДокументНомер";
	
	УсловиеПериод = "";
	Если ЗначениеЗаполнено(Параметры.НачалоПериода) И ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		УсловиеПериод = "И Проводки.Период МЕЖДУ &НачалоПериода И &КонецПериода";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	ИначеЕсли ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
		УсловиеПериод = "И Проводки.Период >= &НачалоПериода";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	ИначеЕсли ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		УсловиеПериод = "И Проводки.Период <= &КонецПериода";
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));		
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеПериод", УсловиеПериод); 
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	Возврат Результат;
	
КонецФункции

Процедура ПерепровестиДокументы(СписокДокументов)
	
	Для Каждого Док Из СписокДокументов Цикл
		
		ДокОбъект = Док.ПолучитьОбъект();
		Отказ = Ложь;
		
		БухгалтерскиеОперацииСервер.ПодготовитьТаблицуПроводокПередЗаписью(ДокОбъект, Отказ,
			РежимЗаписиДокумента.Проведение, Неопределено);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписей = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Док);
		НаборЗаписей.Прочитать();
		
		ТекущиеПроводки = НаборЗаписей.Выгрузить();
		
		Попытка
			
			НачатьТранзакцию();
			
			БухгалтерскиеОперацииСервер.ЗаписатьБухгалтерскуюОперациюПриЗаписи(ДокОбъект, Отказ);
			
			Если Отказ Тогда
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			НовыеПроводки = ДокОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения.ТаблицаПроводок;
			
			Если ТипЗнч(НовыеПроводки) <> Тип("ТаблицаЗначений") Тогда
				ОтменитьТранзакцию();
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При перепроведении документа %1.
						|не удалось сформировать проводки.'"),
						Док), Док);					
				Возврат;
			КонецЕсли;
			
			Если ТаблицыРазличаются(ТекущиеПроводки, НовыеПроводки) Тогда
				ОтменитьТранзакцию();
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При перепроведении документа %1.
						|проводки будут изменены. Необходимо вручную внести изменения в проводки или перепровести документ.'"),
						Док), Док);		
				Возврат;
			КонецЕсли;
			
			НаборЗаписей.Загрузить(НовыеПроводки);
			
			Попытка
				
				НаборЗаписей.Записать();
				
				ЗафиксироватьТранзакцию();
				
				Результат = ОбщегоНазначения.ЗначениеВСтрокуXML(Док);  
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "#Документ#" + Результат;
				Сообщение.Сообщить();
				
			Исключение
				
				ОтменитьТранзакцию();
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При перепроведении документа %1.
					|не удалось записать проводки.'"),
					Док), Док);  
				Возврат;
				
			КонецПопытки;
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "#ПерепроведениеЗавершено#";
	Сообщение.Сообщить();	
	
КонецПроцедуры

Функция ТаблицыРазличаются(Таблица1, Таблица2)
	
	Если Таблица1.Количество() <> Таблица2.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Сч = 1 По Таблица1.Количество() Цикл
		Если Таблица1[Сч-1].Сумма <> Таблица2[Сч-1].Сумма Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ВыполнитьОперацию", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
